# GetUIDocumentMacroSecurityOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIMacroManager..::..GetUIDocumentMacroSecurityOptions Method
UIMacroManager Class See Also
---
Gets the UI document macro security options.
**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static UIDocumentMacroOptions GetUIDocumentMacroSecurityOptions(
	UIApplication application
)
```

Visual Basic
---
```text
Public Shared Function GetUIDocumentMacroSecurityOptions ( _
	application As UIApplication _
) As UIDocumentMacroOptions
```

Visual C++
---
```text
public:
static UIDocumentMacroOptions GetUIDocumentMacroSecurityOptions(
	UIApplication^ application
)
```

# ### Parameters
application
    Type: Autodesk.Revit.UI..::..UIApplication The UI application.
# ### Return Value
Returns the UI document macro security options.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was NULL |

# See Also
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace